#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
random_password.client_password: Refreshing state... [id=none]
random_uuid.client_username: Refreshing state... [id=a1582ac8-4a25-1669-b5ca-af0011e0ab25]
random_pet.client_hostname: Refreshing state... [id=deep-dingo]
aws_route53_zone.zone: Refreshing state... [id=Z10387623VC2UL2NU3ZZ9]
aws_route53_zone.sandbox_zone: Refreshing state... [id=Z100993817TJFWA5QJDPB]
cloudfoundry_route.ssb_uri: Refreshing state... [id=32a63578-b902-4648-92ab-5a945d16c6a1]
cloudfoundry_service_instance.db: Refreshing state... [id=3c9a0f58-c784-4f71-8872-f2052c95df43]
cloudfoundry_app.ssb: Refreshing state... [id=06e499ae-14e5-4f42-b185-cc34e6d34f87]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/development"]: Refreshing state... [id=c17a5163-fc28-4dcf-b410-6c3fb9905c5b]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/prod"]: Refreshing state... [id=a508e14d-c0d0-42b9-9904-eb3f2458b3d8]
cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/staging"]: Refreshing state... [id=29140105-f171-46c2-9634-5dd8305223a9]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment          = (sensitive value)
        id                   = "06e499ae-14e5-4f42-b185-cc34e6d34f87"
      ~ id_bg                = "06e499ae-14e5-4f42-b185-cc34e6d34f87" -> (known after apply)
        name                 = "ssb"
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/management"] will be created
  + resource "cloudfoundry_service_broker" "space-scoped-broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-gsa-datagov-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + url                              = "https://ssb-deep-dingo.app.cloud.gov"
      + username                         = "a1582ac8-4a25-1669-b5ca-af0011e0ab25"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ client_spaces = [
        "gsa-datagov/development",
      + "gsa-datagov/management",
        "gsa-datagov/prod",
        # (1 unchanged element hidden)
    ]

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @mogul, Action: `pull_request`*